In [ ]:
## choose scala notebook in Databrick
## This is Spark SQL

### Load data

In [ ]:
val df = sqlContext
  .read.format("com.databricks.spark.csv")
  .option("header", "true")
  .load("dbfs:/databricks-datasets/data.gov/irs_zip_code_data/data-001/2013_soi_zipcode_agi.csv")
df.createOrReplaceTempView("df")
df.printSchema()

display(df)
#show the column names in the df table
%sql SHOW columns FROM df
%sql DESCRIBE df 

#list the tables
%sql show tables
#list the databases
%sql show databases;

#cache tables (can store and access tables in memory)
%sql CACHE TABLE df

### display data or plot data

In [ ]:
display(df)

# you can plot
display(df.groupBy("State").count())

### create a new table

In [ ]:
#create a new table df1
%sql 
DROP TABLE IF EXISTS df1;
CREATE TABLE df1 AS
SELECT state, 
  int(zipcode / 10) as zipcode_new, 
  int(mars1) as mars1_new, 
  double(a00900) as a00900_new
FROM df

###############################
%sql 
DROP TABLE IF EXISTS df2;
CREATE TABLE df2 AS
SELECT zipcode, mars1
FROM df
LIMIT 3
#inserts a single row into the df2 table
#need to fill all columns
%sql 
INSERT INTO df2 
VALUES (0,22)
#inserts rows from other table
INSERT INTO df2
SELECT df.zipcode, df.mars1 
FROM df 
WHERE df.mars1 > 1000;
###############################
%sql 
DROP TABLE IF EXISTS df2;
CREATE TABLE df2 (name STRING, age INT, salary Double, time TIMESTAMP)

%sql 
INSERT INTO df2 
VALUES (0, null, 2.0, NOW())
###############################
%sql 
CREATE TABLE t1 (x TIMESTAMP)

%sql
INSERT INTO t1 VALUES (now()), (now() + interval 1 day)
#t1 table become
#x
#2017-09-21T20:55:38.313+0000
#2017-09-22T20:55:38.313+0000
%sql
INSERT INTO t1 VALUES ('1966-07-30'), ('1985-09-25 17:45:30.005'), ('08:30:00');

### select

In [ ]:
%sql 
SELECT column1name 
SELECT column1name, column2name
SELECT *                                 ##select all columns
SELECT column1name / 10                  ##this column is divided by 10 
SELECT column1name * 10 
SELECT column1name + 10 
SELECT column1name - 10 
SELECT IFNULL(column1name,0)             ##if "column1name" is NULL,it set the column1name value to be zero
SELECT ISNULL(column1name)               ##if "column1name" value is not NuLL, it show false
SELECT COALESCE(column1name,0)           ##if "column1name" is NULL,it set the column1name value to be zero
SELECT column1name AS column1name_new
SELECT column1name + column1name AS column1name_new  ##if add column values
SELECT DISTINCT column1name              ##return only values that are distinct        
SELECT DISTINCT column1name, column2name ##show all the possible combinations of column1name and column2name 

SELECT SIGN(column1name)                 ## positive value become 1, o become 0, negative value become -1
SELECT COS(column1name)                  ## returns the cosine of a number 
SELECT SIN(column1name)                  ## returns the sine of the argument
SELECT TAN(column1name)                  ## returns the tangent of the argument.
SELECT ACOS(column1name)                 ## returns the arc cosine of a number
SELECT ASIN(column1name)                 ## returns the arc sine of a number
SELECT ATAN(column1name)                 ## returns the arc tangent of a number
SELECT EXP(column1name)
SELECT LN(column1name)                   ##loge=LOG
SELECT LOG(column1name) 
SELECT LOG2(column1name) 
SELECT LOG10(column1name)
SELECT RADIANS(column1name)              ##converts the value of a number from degrees to radians
SELECT SQRT(column1name)                 ##returns the square root of a non-negative number of the argument
SELECT PI()                              ##the pi value

SELECT CEIL(column1name)                 ## returns the smallest integer value not less than the number specified 
SELECT FLOOR(column1name)                ## returns the largest integer value not greater than a number 
SELECT ROUND(column1name)                ## 4.43 become 4, 4.53 become 5
SELECT ROUND(column1name,2)              ## Rounds a numeric field to 2 decimal places

#!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
# return one value
SELECT COUNT(column1name)                ##  return row numbers with non-null values in a column
SELECT COUNT(DISTINCT column1name)
SELECT COUNT('*')                        ##  return how many rows are in the entire table 
SELECT AVG(column1name)                  ##  return a column avarage
SELECT MAX(column1name)                  ##  return a column maximum value
SELECT MIN(column1name)                  ##  return a column minimum value
SELECT SUM(column1name)                  ##  return sum of all a column's value
SELECT STD(column1name)                  ##  returns the population standard deviation  
SELECT STDDEV(column1name)                
SELECT STDDEV_SAMP(column1name)          .
SELECT STDDEV_POP(column1name)           ##  returns the population standard deviation of an expression ( the square root of VAR_POP())
SELECT VARIANCE(column1name)             ##  the population standard variance of an expression
SELECT VAR_POP(column1name)              ##  returns the population standard variance of an expression
SELECT VAR_SAMP(column1name)             ##  returns the sample variance of a given expression
SELECT VAR_POP(column1name)              ##  returns the population standard variance of an expression
SELECT FIRST(column1name)                ##  returns the first value
SELECT LAST(column1name)                 ##  returns the last value
#!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
#for string columns
SELECT LCASE(column1name)                ##  converts the "breed" column to lowercase
SELECT LOWER(column1name)
SELECT UCASE(column1name)                ##  converts the "breed" column to uppercase
SELECT UPPER(column1name)
SELECT TRIM(column1name)                 ## trim space, for example: '  br  ' become 'br'
SELECT SUBSTR(column1name,2,3)           ## returns 3 numbers of characters from the 2th position of the string, ex '12345' beome '234'
SELECT CONCAT(column1name, ',', column3name) ## if the values of column1 and column2 are AL and BC, it bcome AL,BC
#!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
#for time column
SELECT MONTH('2009-05-18 11:45:42')      ## return 5
SELECT MONTH(column1name)                ## if the value of the column1name is 2009-05-18, it will return 5
SELECT YEAR(column1name) 
SELECT DAY(column1name) 
SELECT HOUR(column1name) 
SELECT MINUTE(column1name)
SELECT SECOND(column1name)
SELECT DATE(column1name)                ##2014-11-22 13:23:44.657 become 2014-11-22
SELECT DATE_ADD(column1name, 2)         ##add the column1name value by 2 days
SELECT NOW()                            ##2017-09-21T20:01:19.591+0000
SELECT now() + interval 1 day           ##2017-09-22T20:01:19.591+0000
SELECT DATEDIFF('1989-09-11','1989-09-01')              #10
SELECT DAYOFMONTH('2008-05-15');                        #15
SELECT CAST('1966-07-30' AS timestamp);                 #1966-07-30T00:00:00.000+0000
SELECT CAST('1985-09-25 17:45:30.005'  AS timestamp)    #1985-09-25T17:45:30.005+0000
SELECT CAST(column1name AS timestamp)
#!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
#IF expression
SELECT column1name,                                   ##if the value of column2name is 'AL', the new column 'column2name_new' show '1'
IF(column2name='AL',"1","0")                          ##otherwise 0
AS column2name_new 

SELECT column1name,                                   ##if the value of column2name is > 10, the new column 'column2name_new' show 1
IF(column2name>10,1,0)                                ##otherwise 0
AS column2name_new 

SELECT column1name,
IF(column2name>10,1,IF(column1name='AL','column1_is_AL','column1_is_not_AL')) 
AS Language 
#!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
# Case expression
SELECT column1name, 
  CASE 
     WHEN column2name = 0 THEN '2'
     WHEN column2name > 2000 AND column2name < 20000 THEN '3'
     ELSE '4'
  END AS column2name_new

SELECT column1name, column2name,
  CASE 
     WHEN column1name = "AL" THEN 'state'
     WHEN column1name != "AK" AND column2name < 20000 THEN '3'
     WHEN column2name >100 OR column3name < 20000 THEN '3'
     WHEN column1name = "AA" AND column2name < 10000 OR column3name = 168170 THEN '5'
     ELSE '4'
  END AS US_user
#CASE WHEN "condition 1" OR "condition 2" AND "condition 3". #need to meet cond2 and cond3 first, and then or cond1
#CASE WHEN ("condition 1" OR "condition 2") AND "condition 3". #need to meet cond1 or cond2 first, and then and cond3
#~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
FROM df
FROM df as d;

### UNION

In [ ]:
#selects all the different cities (only distinct values) from the "Customers" and the "Suppliers" tables:
#If several customers and suppliers share the same city, each city will only be listed once. 
SELECT City FROM Customers
UNION
SELECT City FROM Suppliers

# select all (duplicate values also) cities from the "Customers" and "Suppliers" tables
SELECT City FROM Customers
UNION ALL
SELECT City FROM Suppliers

#select all (duplicate values also) German cities from the "Customers" and "Suppliers" tables
# the result will show two columns - City and Country which are all 'Germany'
SELECT City, Country FROM Customers
WHERE Country='Germany'
UNION ALL
SELECT City, Country FROM Suppliers
WHERE Country='Germany'

### WHERE

In [ ]:
SELECT column1name
FROM df
#~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# Can use !=, =, <,>,<=, and >=. 
WHERE column1name !='AL'                     ## select the rows that the column1name value is  !='AL'
WHERE NOT column1name='AL'
WHERE column1name  ='AL'                     ## select the rows that the column1name value is  'AL'
WHERE column1name IN ("AK","BN")             ## select the rows that the column1name value is "AK" or "BN"
WHERE column1name NOT IN ("AK","BN")         ## select the rows that the column1name value is not "AK" or "BN"

WHERE column1name BETWEEN 100 AND 500        ## select the rows that the column1name value is  100 ~ 500
WHERE column1name NOT BETWEEN 100 AND 500    ## select the rows that the column1name value is  NOT BETWEEN 100 AND 500
WHERE column1name BETWEEN 'A' AND 'C'        
## select the rows that the column1name beginning with any of the letter BETWEEN 'A' and 'C'
WHERE column1name BETWEEN #07/04/1996# AND #07/09/1996#
WHERE column1name BETWEEN '22/02/2009 09:00:00.000' and '23/05/2009 10:30:00.000'
WHERE (column1name BETWEEN 100 AND 500) AND NOT column2name IN (1,2,3)
#selects all rows with a column1name BETWEEN 100 and 500, but the column2name IS NOT 1,2, or 3

WHERE column1name > GREATEST(100, 200,300,395) 
## select the rows that the column1name column is > the largest value of (100, 200,300,395)
WHERE column1name > LEAST(100, 200,300,395)
## select the rows that the column1name column is > the smallest value of (100, 200,300,395)

WHERE column1name ='AL' OR column2name > 1000
WHERE column1name ='AL' AND column2name > 1000
WHERE column1name ='AL' AND (column2name > 1000 OR column3name > 2000)

WHERE column1name LIKE ("%53%")             ## select the rows that the column1name value contains '53', ex: 46653
WHERE column1name NOT LIKE ("%53%")         ## select the rows that the column1name value don't contain '53'
WHERE column1name LIKE ("%53")              ## select the rows that the column1name value ends with '53'
WHERE column1name LIKE ("53%")              ## select the rows that the column1name value starts with '53'
WHERE column1name regexp '^K.*'             ## select the rows that the column1name value starts with  'K', ex: 'Kay'
WHERE column1name rlike '^K.*'
# 'd' is optional and the 'L' can be upper- or lowercase.
WHERE column1name regexp '^Kyd?[Ll]e$'      ## select the rows that the column1name value is kyLe or kyle or kydLe or kydle 
WHERE column1name regexp '^(Ky|kd)le$''     ## select the rows that the column1name value is Kyle or kdle
WHERE column1name regexp '^[A-C].*'         ## select the rows that the column1name value starts with A, B, or C

WHERE column1name IS NOT NULL
WHERE column1name IS NULL                   ## select the rows that the column1name value is NULL
WHERE column1name !="None"
WHERE column1name !=""                      ## excludes empty string entries 
#!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
# for time column
WHERE DAY(column1name) > 15                 ## select data  after the 15th day of every month 
WHERE YEAR(column1name) > 2010
WHERE MONTH(column1name) > 2
WHERE HOUR(column1name) > 10
WHERE MINUTE(column1name) > 10
WHERE SECOND(column1name) > 10
WHERE column1name > '2014-02-04'            ## select data  after '2014-02-04'
#!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
# subqueries
WHERE column1name > 
    (SELECT AVG(column1name)
     FROM df
     WHERE column1name>0)
# query a list of all the zipcode in the df table which are also in the df1 table
#EXISTS/NOT EXISTS statements return a value of TRUE or FALSE
# list all the distinct zipcode values from the df table that have a value of "TRUE" in the EXISTS clause.
SELECT  DISTINCT u.zipcode
FROM df u
WHERE EXISTS (SELECT d.zip  
              FROM df1 d 
              WHERE u.zipcode =d.zip);
# query a list of all the zipcode in the df table which are not in the df1 table
SELECT  DISTINCT u.zipcode
FROM df u
WHERE NOT EXISTS (SELECT d.zip  
              FROM df1 d 
              WHERE u.zipcode =d.zip);

### GROUP BY

In [ ]:
#if you are grouping by a column, you should also include that column in the SELECT statement.
#for example: average all the rows for each group.
SELECT column1name, AVG(column2name) as avg_column2name
FROM df
GROUP BY column1name

SELECT YEAR(column1name), COUNT(column2name) 
FROM df
GROUP BY YEAR(column1name)


SELECT column1name,column2name,COUNT(column3name)
FROM df
GROUP BY column1name,column2name
#~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#Note:
#column B  A
#       a  10
#       a  20
#       a  20
#SELECT A, B, COUNT(A)
#GROUP BY B
#it will show 
#  A  B count(B)
#  10 a  3
# only show the first value of A column in each group 
Correct:
#GROUP BY A, B
# it will show
#  A  B count(B)
#  10 a  1
#  20 a  2
#~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

### HAVING

In [ ]:
#The HAVING clause was added to SQL because the WHERE keyword could not be used with aggregate functions
SELECT column1name,COUNT(column2name)
FROM df
GROUP BY column1name
HAVING COUNT(column2name) > 5
# only choose COUNT(column2name) > 5 data

SELECT column1name,COUNT(column2name)
FROM df
GROUP BY column1name
HAVING AVG(column2name) > 2

### ORDER BY

In [ ]:
SELECT column1name, column2name
FROM df
#~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ORDER BY column1name DESC          #sort the "column1name" column in descending order
ORDER BY column1name               #sort the "column1name" column in alphabetical (ascending) order
ORDER BY column1name, column2name  #sort the "column1name" column and then the "column2name" column in (ascending)  order
ORDER BY column1name ASC, column2name DESC #sorted ascending by the column1name and descending by the column2name

### LIMIT

In [ ]:
SELECT column1name
FROM df
#~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
LIMIT 5          ## show first 5 rows

### Join

In [ ]:
################# inner join ##############################
#The INNER JOIN keyword selects all rows from both tables as long as there is a match between the columns in both tables.
#~~~~~~~~~~~~~ for 2 tables ~~~~~~~~~~~~~~~~~~~~~~~~~~
#Method 1
SELECT d.zipcode, u.zip, d.STATE
FROM df d, df1 u
WHERE d.zipcode=u.zip
#Method 2
SELECT d.zipcode, u.zip, d.STATE
FROM df d
JOIN df1 u  #INNER JOIN  df1 u
  ON d.zipcode=u.zip    
#~~~~~~~~~~~~~ for 3 tables ~~~~~~~~~~~~~~~~~~~~~~~~~~
FROM df a, df1 b, df2 c
WHERE a.zipcode=b.zip
   AND a.STATE=c.state 

FROM ((df a
INNER JOIN df1 b
ON a.zipcode=b.zip)
INNER JOIN df2 c
ON a.STATE=c.state)
################# left join ##############################
#The LEFT JOIN keyword returns all rows from the left table (table1), with the matching rows in the right table (table2). 
#The result is NULL in the right side when there is no match.
LEFT JOIN
################# right join ##############################
#The RIGHT JOIN keyword returns all rows from the right table (table2), with the matching rows in the left table (table1). 
#The result is NULL in the left side when there is no match.
RIGHT JOIN 
################# full outer join ##########################
#The FULL OUTER JOIN keyword returns all rows from the left table and from the right table.
FULL OUTER JOIN 
################# cross join for two tables ################
#table1  id  value    table2  id2  value2
#        1    405            701  16
#        2    401            704  14
SELECT table2.id2, table2.value2,table1.id, table1.value
FROM table2
CROSS JOIN table1
#show id2 value2 id value
#     701  16    1  405
#     704  14    1  405
#     701  16    2  401
#     704  14    2  401

### Insert values and update Values to an existing table

In [ ]:
#create a new table only has two columns : zipcode, mars1
DROP TABLE IF EXISTS df2;
CREATE TABLE df2 AS
SELECT zipcode, mars1
FROM df
LIMIT 3
#~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#inserts a single row into the df2 table
#need to fill all columns
%sql 
INSERT INTO df2 
VALUES (0,22)
#inserts rows from other table
INSERT INTO df2
SELECT df.zipcode, df.mars1 
FROM df 
WHERE df.mars1 > 1000;

### use scala

In [ ]:
# convert a table into RDD
val rdd= sqlContext.sql("SELECT * FROM df")